
{
  "college": "C Abdul Hakeem College of Engineering and Technology",
  "department": "Department of Computer Science Engineering",
  "symposium": "Eloquence'25",
  "location": {
    "name": "CAHCET, Ranipet",
    "address": "C Abdul Hakeem College of Engineering and Technology, Ranipet, Tamil Nadu",
    "mapUrl": "https://maps.google.com/maps?q=C%20Abdul%20Hakeem%20College%20of%20Engineering%20and%20Technology&t=&z=13&ie=UTF8&iwloc=&output=embed"
  },
  
  "events": [
    {
      "id": "coding-debugging",
      "title": "Coding & Debugging",
      "type": "tech",
      "short": "Speed rounds in logic and code.",
      "venue": "Lab 1 & 2",
      "timing": "10:40 AM – 12:40 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 1,
      "rules": [
        "Round 1 is a written test on Aptitude and Code Analysis; no gadgets allowed.",
        "Top 15 scorers advance to the final debugging round on a provided system.",
        "The first participant to solve any 3 of the 6 given problems wins.",
        "Finalists are ranked by problems solved and time taken.",
        "Allowed languages for the final round are C, C++, Java, and Python.",
        "This is an individual event; any form of malpractice leads to disqualification.",
        "The organizers' decisions on code execution and results are final."
      ],
      "contact": {
        "name": "Mohammed Raiyan. A",
        "phone": "9585790805"
      }
    },
    {
      "id": "paper-presentation",
      "title": "Paper Presentation",
      "type": "tech",
      "short": "Present cutting-edge research.",
      "venue": "Lab 1 & Smart Room",
      "timing": "10:00 AM – 2:00 PM",
      "registrationFee": "₹100 per head",
      "minMembers": 1,
      "maxMembers": 3,
      "rules": [
        "Submit a 300-word abstract during registration and the final PPT/PDF before the event.",
        "Each team has 8 minutes to present, followed by a 2-minute Q&A session.",
        "Content must be strictly original; any plagiarism will result in immediate disqualification.",
        "Topics must be relevant to current or emerging trends in technology and engineering.",
        "Participants are responsible for their presentation files; organizers are not liable for technical glitches.",
        "Presentations are evaluated on technical content, clarity, and Q&A performance.",
        "The decision of the judging panel is final."
      ],
      "contact": {
        "name": "Balamurugan",
        "phone": "6379449459"
      }
    },
    {
      "id": "web-designing",
      "title": "Web Development",
      "type": "tech",
      "short": "Design a responsive web UI.",
      "venue": "CSE Smart Room",
      "timing": "10:40 AM – 1:30 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 2,
      "rules": [
        "Participants must bring their own laptop, charger, and a mobile for internet.",
        "A design theme and required assets will be provided on the spot.",
        "Use any technology stack, but pre-made external templates are forbidden.",
        "The entire web UI must be completed and submitted within the time limit.",
        "Submissions are judged on UI/UX design, creativity, responsiveness, and code quality.",
        "The final project must reflect the team's own design and implementation work.",
        "The decision of the judges on aesthetics and functionality is final."
      ],
      "contact": {
        "name": "Abdul Fawaz. N",
        "phone": "9894574006"
      }
    },
    {
      "id": "tech-quiz",
      "title": "Tech Quiz",
      "type": "tech",
      "short": "Test your tech IQ.",
      "venue": "EEE Department",
      "timing": "10:40 AM – 12:40 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 2,
      "rules": [
        "A team event with a preliminary round followed by finals for qualifying teams.",
        "The use of mobile phones or any internet-enabled device is strictly forbidden.",
        "Questions will cover core CSE/IT domains like programming, networks, databases, and AI.",
        "Hints from the audience are not allowed and may lead to a team's disqualification.",
        "The quiz will consist of multiple formats, including buzzer and rapid-fire rounds.",
        "Rules for scoring and negative marking will be announced before each round.",
        "The quizmaster's decision on all answers and scores is final and binding."
      ],
      "contact": {
        "name": "Abdul Bari .N",
        "phone": "9597225564"
      }
    },
    {
      "id": "poster-making",
      "title": "Poster Design",
      "type": "tech",
      "short": "Theme based digital design.",
      "venue": "Lab 4",
      "timing": "10:40 AM – 12:40 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 1,
      "rules": [
        "This is a digital event; participants must bring their own laptops.",
        "The theme or topic for the poster will be announced on the spot.",
        "Participants can use any design software (e.g., Canva, Photoshop, Figma).",
        "AI tools are permitted for assistance, but the final design must be your own work.",
        "The poster must be designed and submitted within the time limit.",
        "Submit the final design in high-resolution JPEG or PNG format.",
        "Posters are judged on creativity, visual appeal, and relevance to the theme."
      ],
      "contact": {
        "name": "Mohammed Irfan .I",
        "phone": "7604989335"
      }
    },
    {
      "id": "connection",
      "title": "Connection",
      "type": "non-tech",
      "short": "Guess the word from clues.",
      "venue": "MBA Seminar Hall",
      "timing": "1:30 PM – 2:30 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 4,
      "rules": [
        "This is a team-based quiz with multiple elimination rounds.",
        "Questions will be displayed on slides for a limited time.",
        "Answers must be submitted instantly as instructed by the host.",
        "The use of mobile phones or any internet search is strictly prohibited.",
        "Top teams from each round will advance to the next.",
        "The team with the most correct answers in the final round wins.",
        "The quizmaster's decision on answers and scoring is final."
      ],
      "contact": {
        "name": "Syed Gaffar. S. M",
        "phone": "8124558566"
      }
    },
    {
      "id": "treasure-hunt",
      "title": "Treasure Hunt",
      "type": "non-tech",
      "short": "Step out and explore.",
      "venue": "EEE Seminar Hall",
      "timing": "01:30 PM – 02:30 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 4,
      "rules": [
        "Teams must solve a series of sequential clues to be the first to find the final treasure.",
        "All clues are hidden exclusively within the college campus premises.",
        "Clues must be solved in the correct order; skipping is not permitted.",
        "Using online maps or getting help from non-team members is strictly forbidden.",
        "Participants must not damage any college property or enter restricted areas.",
        "Teams may be required to collect specific items as proof of progress.",
        "The first team to reach the final destination with all required proofs wins."
      ],
      "contact": {
        "name": "Afsal",
        "phone": "7904887817"
      }
    },
    {
      "id": "cooking-without-fire",
      "title": "Cooking Without Fire",
      "type": "non-tech",
      "short": "A fun culinary challenge.",
      "venue": "Physics Lab",
      "timing": "11:00 AM – 1:30 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 3,
      "rules": [
        "Prepare three dishes (starter, main, dessert) without any fire or electrical heating.",
        "Only raw, fresh, or ready-to-eat ingredients are permitted.",
        "Teams must bring all their own ingredients, cutlery, and serving dishes.",
        "All preparation must be completed within the specified time limit.",
        "Dishes will be judged on taste, creativity, presentation, and hygiene.",
        "Participants must maintain a clean and organized workspace.",
        "The judges' decision is final and binding."
      ],
      "contact": {
        "name": "Syed Abdul Razzak .H",
        "phone": "6381253104"
      }
    },
    {
      "id": "esports",
      "title": "E-Sports (Free Fire)",
      "type": "non-tech",
      "short": "Battle Royale showdown.",
      "venue": "MBA Seminar Hall",
      "timing": "11:00 AM – 1:00 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 4,
      "maxMembers": 4,
      "rules": [
        "The tournament will be played in Free Fire's Classic Battle Royale mode.",
        "The use of hacks, cheats, or emulators will result in an immediate ban.",
        "Players must use their registered In-Game Names; unregistered players are not allowed.",
        "You are responsible for your device and internet connection; no rematches for disconnections.",
        "Teams must join the custom room lobby at the specified time or risk forfeiture.",
        "Scoring is based on a combination of final placement and total kills.",
        "All decisions made by the event organizers are final."
      ],
      "contact": {
        "name": "Bharath",
        "phone": "9629688672"
      }
    },
    {
      "id": "reels-photography",
      "title": "Reels & Photography",
      "type": "non-tech",
      "short": "Capture, shoot and showcase.",
      "venue": "Open Campus",
      "timing": "11:00 AM – 1:00 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 1,
      "rules": [
        "Submit one photo and one reel (max 60s) based on a theme given on the spot.",
        "All content must be created on the event day within the campus using a smartphone.",
        "Minor photo edits are allowed; no heavy manipulation. The reel must be your own work.",
        "Submissions must be original. Using stock content or AI generation is forbidden.",
        "Upload the final entry as a single Instagram post with the event hashtag.",
        "Content must be appropriate for a general audience. Do not enter restricted areas.",
        "Judged on creativity, theme relevance, and combined technical quality."
      ],
      "contact": {
        "name": "Sasank Sekhar Patnaik",
        "phone": "9342761293"
      }
    },
    {
      "id": "chess",
      "title": "Chess",
      "type": "non-tech",
      "short": "Strategic board battle.",
      "venue": "CSE Classroom",
      "timing": "10:40 AM – 01:00 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 1,
      "rules": [
        "Matches will be played in the Blitz format, with a time limit per player.",
        "Standard FIDE rules apply, including touch-move.",
        "Opponents will be assigned by organizers; self-selection is not allowed.",
        "Mobile phones and smartwatches are strictly prohibited at the playing table.",
        "In case of a tie in final scores, a tie-breaker round will be conducted.",
        "The ruling of the event arbiter on any dispute is final.",
        "Players are expected to maintain good sportsmanship."
      ],
      "contact": {
        "name": "Mohammed Shuraim",
        "phone": "8778265516"
      }
    },
    {
      "id": "mehendi",
      "title": "Mehendi",
      "type": "non-tech",
      "short": "Traditional art contest.",
      "venue": "CSE Classroom",
      "timing": "11:00 AM – 12:40 PM",
      "registrationFee": "₹50 per head",
      "minMembers": 1,
      "maxMembers": 1,
      "rules": [
        "Participants must bring their own Mehendi cones and a person to apply the design on.",
        "A design theme will be announced on the spot, and a strict time limit will be enforced.",
        "The design must be applied on one side of one hand, from fingertips to wrist.",
        "Designs must be original and freehand; stencils or reference images are not allowed.",
        "The use of glitter or other decorative accessories is strictly forbidden.",
        "Judged on neatness, creativity, intricacy of the design, and relevance to the theme.",
        "The decision of the judges is final."
      ],
      "contact": {
        "name": "Abrar Baig",
        "phone": "7904232181"
      }
    }
  ]
}
